tutorials/multiphase/interFoam/micromodel/0_org/pd
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      pd;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet 
    {
        type            zeroGradient;
    }

    outlet 
    {
        type            fixedValue;
        value uniform 0;
    }

    solidwalls
    {
        type            zeroGradient;
    }

    walls 
    {
        type            zeroGradient;
    }

    frontandback
    {
        type            empty;
    }
}

// ************************************************************************* //
