tutorials/multiphase/interFoam/micromodel/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
phase1 water;
phase2 oil;
water
{
	transportModel  Newtonian;
	nu              nu [ 0 2 -1 0 0 0 0 ] 1e-06;
	rho             rho [ 1 -3 0 0 0 0 0 ] 1000;
}


oil
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1.65e-5;
    rho             rho [ 1 -3 0 0 0 0 0 ] 864;
}

sigma        sigma [ 1 0 -2 0 0 0 0 ]   0.03;
