tutorials/multiphase/interFoam/micromodel/system/controlDictRun
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


application     simpleDBSFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         var;

deltaT          2;

writeControl    timeStep;

writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

checkFrequency 1;

libs (
"libboundaryConditions.so"
"libmeshToolsGCFOAM.so"
);

OptimisationSwitches
{
    commsType       blocking;
}

// ************************************************************************* //
